БухЭксп/ChartsOfCharacteristicTypes/CW_ПараметрыГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CW_ПараметрыГрузоперевозок</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Склады</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ЖелезнодорожныеСтанции</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторДОПОГЭПД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_СкладыВременногоХранения</v8:Type>
				<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_РазмерыКонтейнеров</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОфисыКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Оборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Линии</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Порты</v8:Type>
				<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
				<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Авиалинии</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыДоговоров</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
				<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ГрузоотправителиИГрузополучатели</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыКонтейнеров</v8:Type>
				<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
				<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Суда</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ДополнительныеЗначенияПараметровГрузоперевозок</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МоделиТС</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ПодразделенияКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Рейсы</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МаркиТС</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторУпаковкиЭПД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Терминалы</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КлассификаторОпасныхГрузов</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Пункты</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Таможни</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыТранспортныхСредств</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_СтатусыОтслеживаемогоОборудования</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Аэропорты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КонтактнаяИнформация</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КонтактыеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>18</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>600</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОтбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантыОтбораДляПараметров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаОтбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаПередНачаломВыбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеПриИзменении</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ДействияПриИзмененииКонтрольнойДаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДинамическийПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕжедневныйПересчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексПиктограммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеОтбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеУсловногоОформления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормуВводаАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормуВыбораОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОбработкаПередНачаломВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДатаИспользуетВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПросрочкиКонтрольнойДаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественноеПрямоеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьВФормеГрузоперевозок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграниченСпискомЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчищатьПриКопировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрОтметкиУведомления</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодготовленнаяФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьПолноеЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВывода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеУсловногоОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВедомыйПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКонтрольнаяДата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСсылочныйТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЧисло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьПГ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУсловия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыУсловийОтбораПараметров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоступноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВедущиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

БухЭксп/Enums/CW_ВариантыОтбораДляПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВариантыОтбораДляПараметров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтандартныйОтбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыУсловийОтбораПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыУсловийОтбораПараметров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Параметр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/ChartsOfCharacteristicTypes/CW_ПараметрыГрузоперевозок/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр 				= (НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеНастроекМониторинга") ИЛИ Объект.ТолькоПросмотр);
	ИспользованиеДинамическихПараметров 	= ПолучитьФункциональнуюОпцию("CW_ИспользованиеДинамическихПараметров");
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	Если  ИспользованиеДинамическихПараметров Тогда
		Элементы.ПереключательКД.СписокВыбора.Добавить(2, "динамический параметр");
	КонецЕсли;
	
	Если Объект.ЭтоКонтрольнаяДата Тогда
		ПереключательКД=1;
	ИначеЕсли Объект.ДинамическийПараметр Тогда 
		ПереключательКД=2;
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	#Область ФормированиеМакросов 
	
	Макросы = CW_Мониторинг.СписокМакросовДинамическихПараметров();
	ТаблицаМакросов.Загрузить(Макросы);
	
	#КонецОбласти 
	
	#Область ФормированиеФормул
	
		СписокФормул = Новый СписокЗначений;
		СписокФормул.Добавить("ТекущаяДата()",					"Текущая дата");
		СписокФормул.Добавить("РазностьДат(<Дата1>,<Дата2>)",	"Разность дат (в днях)");
	
		Для каждого Элемент Из СписокФормул Цикл
			Нстр = ТаблицаФормул.Добавить();
			Нстр.Макрос 		= Элемент.Значение;
			Нстр.Описание 		= Элемент.Представление;
			Нстр.ИндексКартинки = 3;
		КонецЦикла; 
	
	#КонецОбласти 
	
	ЗаполнитьВедущиеПараметры();
	
	// ---------------------------------------------------------------------------- 
	
	УО = РеквизитФормыВЗначение("Объект").ХранилищеУсловногоОформления.Получить();
	Если (УО <> Неопределено) Тогда
		
		АдресУО = ПоместитьВоВременноеХранилище(УО,ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли; 
	
	ИспользованиеПодключаемыхОбработокПриИзмененииПараметров  = ПолучитьФункциональнуюОпцию("CW_ИспользованиеПодключаемыхОбработокПриИзмененииПараметров");
	
	Элементы.ГруппаПередНачаломВыбора.Видимость 		= ИспользованиеПодключаемыхОбработокПриИзмененииПараметров и Не Объект.ИспользоватьФормуВыбораОбъекта;
	Элементы.ГруппаОбработкаИзменения.Видимость 		= ИспользованиеПодключаемыхОбработокПриИзмененииПараметров;
	
	Если Параметры.Ключ.пустая() и Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("Строка");
	КонецЕсли;
	
	_ОтборПоПравам();
	_ПроверитьТипЗначения();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры    

//Ведущие и ведомые
&НаСервере
Процедура ЗаполнитьВедущиеПараметры()
	
	Для каждого СтрокаВедущих из Объект.ВедущиеПараметры Цикл
		ВедущиеПараметры.Добавить(СтрокаВедущих.Параметр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВедущиеПараметры(ТекущийОбъект)
	
	ТекущийОбъект.ВедущиеПараметры.Очистить();
	Для каждого ЭлементСписка из ВедущиеПараметры Цикл
		НоваяСтрока = ТекущийОбъект.ВедущиеПараметры.Добавить();
		НоваяСтрока.Параметр = ЭлементСписка.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВедущиеПараметрыПоФормуле()
	
	ВедущиеПараметры.Очистить();
	
	//Добавляем новые
	МакросыФормулы = _сф.стр_СписокМакросов(Объект.Формула,"{}");
	
	Для Каждого ЭлементМассива из МакросыФормулы Цикл
		ИмяМакроса = "{"+ЭлементМассива+"}";
		
		Отбор = Новый Структура("Макрос", ИмяМакроса);
		мСтрока = ТаблицаМакросов.НайтиСтроки(Отбор);
		Если мСтрока.Количество() > 0 Тогда
			//Всегда одна строка
			НайденнаяСтрока = мСтрока[0];
			ДобавитьПараметрВСписок(ВедущиеПараметры, НайденнаяСтрока.Параметр);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПараметрВСписок(ВедущиеПараметры, ТекущийПараметр)
	
	Если ВедущиеПараметры.НайтиПоЗначению(ТекущийПараметр) = Неопределено Тогда
		
		ВедущиеПараметры.Добавить(ТекущийПараметр);
		
		//Если у текущего параметра есть ведущие, то добавим в списко и их (ведущие второго и третьего уровня)
		Для Каждого СтрокаВедущего из ТекущийПараметр.ВедущиеПараметры Цикл
			ДобавитьПараметрВСписок(ВедущиеПараметры, СтрокаВедущего.Параметр);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
//Ведущие и ведомые

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		ИзменилосьНаименование = ЗначениеРеквизитаИзменилосьНаСервере("Наименование");
		                                                                              
		Если ИзменилосьНаименование и НЕ ПродолжитьЗапись Тогда
			Отказ = Истина;
			
			ТекстВопроса = "Изменение наименования параметра может повлечь 
			               |за собою возникновение программных ошибок                                
						   |в отчетах или списках, в которых данный параметр  
			               |используется в качестве отборов или группировок.  
			               |Перенастройка таких отборов и группировок должна  
			               |быть произведена пользователем самостоятельно 
						   |в ручном режиме. Продолжить?";
			
			Режим = РежимДиалогаВопрос.ДаНет;          
			
			ДополнительынеПараметры = Новый Структура;
			ДополнительынеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
			
			Оповещение = Новый ОписаниеОповещения("ПродолжитьЗаписьПараметра", ЭтотОбъект, ДополнительынеПараметры);
			ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
			
		КонецЕсли;
		
		Если ТипЗначенияИзменен Тогда
			Отказ = Истина;
			ДиалогПодтвержденияИзмененияТипа();
		КонецЕсли;
		
	КонецЕсли;  
	
	Если ПродолжитьЗапись Тогда
		ПродолжитьЗапись = Не ПродолжитьЗапись;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПродолжитьЗаписьПараметра(Результат, ДополнительынеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ПродолжитьЗапись = Истина;
	ЭтаФорма.Записать(ДополнительынеПараметры.ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаИзменилосьНаСервере(ИмяРеквизита)
	
	Возврат Объект[ИмяРеквизита] <> Объект.Ссылка[ИмяРеквизита];
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если (ЭтоАдресВременногоХранилища(АдресУО)) Тогда
		Нечто = ПолучитьИзВременногоХранилища(АдресУО);
		ТекущийОбъект.ХранилищеУсловногоОформления = Новый ХранилищеЗначения(Нечто);
	КонецЕсли; 
	
	ТекущийОбъект.СформироватьИдентификатор();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПараметрыГрузоперевозок.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	|ГДЕ
	|	CW_ПараметрыГрузоперевозок.Идентификатор = &Идентификатор
	|	И CW_ПараметрыГрузоперевозок.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("Идентификатор", ТекущийОбъект.Идентификатор); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() <> 0 Тогда
		
		Отказ = Истина;
		Сообщить("Неуникальное наименование параметра. Параметр с таким именем уже существует.",СтатусСообщения.Внимание);
		Возврат;
		
	КонецЕсли; 	
	
	Если ИзмененаФормула Тогда
		ОбновитьВедущиеПараметрыПоФормуле();
		ЗаписатьВедущиеПараметры(ТекущийОбъект);
	КонецЕсли;
	
	ОповещатьОбИзмененииПараметра = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	_ОтборПоПравам();
	
	ЗаполнитьВедущиеПараметры();
	
	ИзмененаФормула = Ложь;

	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	CW_МониторинговыеПараметрыКлиент.ОбновитьНаименованияСвязанныхПараметров(ЭтаФорма, Объект.Ссылка);
	
	Если ОповещатьОбИзмененииПараметра Тогда
		
		ОповещатьОбИзмененииПараметра = Ложь;
		Оповестить("ПараметрИзменен",Объект.Ссылка);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	// для динамического параметра отобразим станицу с формулой
	Элементы.СтраницаДинамическийПараметр.Видимость = (Объект.ДинамическийПараметр);
	
	Элементы.ТипЗначения.Видимость = (НЕ Объект.ЭтоКонтрольнаяДата);
	Элементы.ФорматВывода.Видимость = ДоступенФорматВывода;
	Элементы.КонтрольнаяДатаИспользуетВремя.Видимость = (Объект.ЭтоКонтрольнаяДата);
	
	Элементы.ОграниченСпискомЗначений.Видимость = (НЕ Объект.ЭтоКонтрольнаяДата);
	
	// для динамических параметров спрячем дополнительные опции
	Элементы.ГруппаОпции.Видимость = (НЕ Объект.ДинамическийПараметр);
	
	Элементы.МножественноеПрямоеРедактирование.Доступность = Объект.ПрямоеРедактирование;
	
	Элементы.ЛимитПросрочки.Видимость = (Объект.ЭтоКонтрольнаяДата);
	
	// ---------------------------------------------------------------------------- 
	
	Элементы.ГруппаКонтрольИзменения.Видимость = Объект.КонтрольИзменения;
	
	// ---------------------------------------------------------------------------- 
	
	Элементы.ГруппаИспользоватьОтбор.Видимость = ЭтоСсылочныйТип;
	Элементы.СтраницаПараметрыОтбора.Видимость = Объект.ИспользованиеОтбора;
	Если Объект.ИспользованиеОтбора Тогда 
		Элементы.ПараметрыОтбора.Видимость = (Объект.ВариантОтбора=Перечисления.CW_ВариантыОтбораДляПараметров.СтандартныйОтбор);
		Элементы.ВнешняяОбработкаОтбора.Видимость = (Объект.ВариантОтбора=Перечисления.CW_ВариантыОтбораДляПараметров.ВнешняяОбработка);
	КонецЕсли;
	
	// --- 
	
	Элементы.ВнешняяОбработкаИзменения.Видимость 			= Объект.ОбработкаИзменения;
	Элементы.ВнешняяОбработкаПередНачаломВыбора.Видимость 	= Объект.ИспользуетсяОбработкаПередНачаломВыбора;
	
	// ---------------------------------------------------------------------------- 
	
	Элементы.СтраницаПредопределенныеЗначения.Видимость = (Объект.ОграниченСпискомЗначений);
	Элементы.СтраницаПрава.Видимость = (НЕ Объект.Ссылка.Пустая() И CW_ПраваДоступа.ПравоДоступно("РедактированиеНастроекМониторинга"));
	Элементы.СтраницаТипыПеревозок.Видимость = (НЕ Объект.Ссылка.Пустая());
	
	// --- 
	Элементы.ИспользоватьФормуВыбораОбъекта.Видимость 	= ЭтоСсылочныйТип;
	
	// ---
	Элементы.ОткрытьСписокДополнительныхЗначенийПараметра.Видимость = Объект.ИспользуютсяДополнительныеЗначения;
	
	Элементы.ГруппаОпцииВложенная.Доступность = Не Объект.НеПоказыватьВФормеГрузоперевозок;
	
	Элементы.ИспользоватьФормуВводаАдреса.Видимость = Объект.ТипЗначения.СодержитТип(Тип("Строка"));
	
КонецПроцедуры

&НаСервере
Процедура _ПроверитьТипЗначения()
	// --- 
	
	Если Объект.ЭтоКонтрольнаяДата Тогда 
		ЭтоСсылочныйТип = Ложь;
		ДоступенФорматВывода = Истина;
		Объект.ТипЗначения = Новый ОписаниеТипов("Дата");
		СтрокаТипа = Строка(Объект.ТипЗначения);
		Возврат;
	КонецЕсли;
	
	Если Объект.ТипЗначения.Типы().Количество() <> 1 Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("Строка");
	КонецЕсли; 
	
	ТипПараметра 			= Объект.ТипЗначения.Типы()[0];
	СтрокаТипа 				= Строка(ТипПараметра);
	ЭтоСсылочныйТип 		= _сф.тип_Ссылочный(ТипПараметра);
	ДоступенФорматВывода 	= Ложь; 
	ЭтоПеречисление 		= Перечисления.ТипВсеСсылки().СодержитТип(ТипПараметра);
	
	Если ЭтоСсылочныйТип Тогда
		// сформируем список выбора для параметров отбора    ОбъектМетаданных
		СписокВыбора = Новый СписокЗначений;
		СсылкаТипа = Новый(ТипПараметра);
		МетаданныеСсылки = СсылкаТипа.Метаданные();
		
		ТипыПолейОтбора = Новый Соответствие;
		
		Для каждого Реквизит Из МетаданныеСсылки.СтандартныеРеквизиты Цикл
			ИмяОтбора = "Отбор."+Реквизит.Имя;
			
			СписокВыбора.Добавить(ИмяОтбора);
			ТипыПолейОтбора.Вставить(ИмяОтбора, Реквизит.Тип);
		КонецЦикла; 
		
		Если Не ЭтоПеречисление Тогда
			Для каждого Реквизит Из МетаданныеСсылки.Реквизиты Цикл   
				ИмяОтбора = "Отбор."+Реквизит.Имя;
				
				СписокВыбора.Добавить(ИмяОтбора);
				ТипыПолейОтбора.Вставить(ИмяОтбора, Реквизит.Тип);
			КонецЦикла;                  
		КонецЕсли;
		
		Элементы.ПараметрыОтбораРеквизитОтбора.СписокВыбора.Очистить();
		Элементы.ПараметрыОтбораРеквизитОтбора.СписокВыбора.ЗагрузитьЗначения(СписокВыбора.ВыгрузитьЗначения());
		
		ОписаниеТиповОтбора = Новый ФиксированноеСоответствие(ТипыПолейОтбора);
		
	Иначе
		
		Если ТипПараметра = Тип("Булево")
			ИЛИ ТипПараметра = Тип("Число")
			ИЛИ ТипПараметра = Тип("Дата") 
		Тогда
			ДоступенФорматВывода = Истина;
		КонецЕсли; 
		
		Если (Объект.ИспользованиеОтбора) Тогда
			
			Объект.ИспользованиеОтбора = Ложь;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если (Объект.ОграниченСпискомЗначений) Тогда
		
		Элементы.ДоступныеЗначенияДоступноеЗначение.ВыбиратьТип=Ложь;
		Элементы.ДоступныеЗначенияДоступноеЗначение.ОграничениеТипа = Объект.ТипЗначения;
		
		Если Объект.ИспользуютсяДополнительныеЗначения Тогда
			//нужен отбор по владельцу
			МассивСвязиПараметровВыбора = новый Массив;
			МассивСвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Ссылка"));
			
			СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязиПараметровВыбора);
			
			Элементы.ДоступныеЗначенияДоступноеЗначение.СвязиПараметровВыбора = СвязиПараметровВыбора;
		КонецЕсли;
		
	КонецЕсли; 
	
	// проверяем
	Если (НЕ Объект.Ссылка.Пустая()) Тогда
		
		Если (Объект.ТипЗначения <> Объект.Ссылка.ТипЗначения) Тогда
			
			ТипЗначенияИзменен = Истина;
			
		Иначе
			
			ТипЗначенияИзменен = Ложь;
			
		КонецЕсли; 
		
	КонецЕсли;    
	
	//ХранениеПолногоЗначения 
	Если Не Объект.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
		Объект.СохранятьПолноеЗначениеПараметра = Ложь;
	Конецесли;  
	
	Элементы.СохранятьПолноеЗначениеПараметра.Видимость = Объект.ТипЗначения.СодержитТип(Тип("Строка"));
	//---ХранениеПолногоЗначения
	
КонецПроцедуры

&НаСервере
Функция _ОтборПоПравам()
	// --- 
	
	Если (НЕ Объект.Ссылка.Пустая()) Тогда
		
		ПраваДоступа.Отбор.Элементы.Очистить();
		_УФС.ДобавитьОтбор(ПраваДоступа.Отбор,"Параметр",,Объект.Ссылка);
		
		// --- 
		
		_УФС.ДобавитьОтбор(СписокТиповПеревозок.Отбор,"ПараметрыГрузоперевозки.Параметр",,Объект.Ссылка);
		
	КонецЕсли;
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ПереключательКДПриИзменении(Элемент)
	
	// произвольный параметр
	Если (ПереключательКД = 0 ) Тогда
		Объект.ЭтоКонтрольнаяДата	= Ложь;
		Объект.ДинамическийПараметр = Ложь;
		
	// контрольная дата	
	ИначеЕсли (ПереключательКД = 1 ) Тогда 
		Объект.ЭтоКонтрольнаяДата	= Истина;
		Объект.ДинамическийПараметр = Ложь;
		
	// динамический параметр
	ИначеЕсли (ПереключательКД = 2) Тогда 
		Объект.ЭтоКонтрольнаяДата	= Ложь;
		Объект.ДинамическийПараметр = Истина;
		
		Объект.ПрямоеРедактирование 				= Ложь;
		Объект.МножественноеПрямоеРедактирование 	= Ложь;
		Объект.ИспользованиеОтбора 					= Ложь;
		
		// почистим дополнительные опции
		Объект.ОчищатьПриКопировании = Ложь;
		
	КонецЕсли; 
	
	_ПроверитьТипЗначения();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматВыводаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияФормата",ЭтотОбъект);
	// --- 
	Конструктор = Новый КонструкторФорматнойСтроки;
	Конструктор.Текст = Объект.ФорматВывода;
	Конструктор.ДоступныеТипы = Новый ОписаниеТипов(СтрокаТипа);
	Конструктор.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияФормата(Текст, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Объект.ФорматВывода = Текст;
	СформироватьПримерФорматаВывода();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ФорматВыводаПриИзменении(Элемент)
	СформироватьПримерФорматаВывода();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПримерФорматаВывода()
	
	//ТипПараметра = Объект.ТипЗначения.Типы()[0];
	//Если ТипПараметра = Тип("Булево") Тогда
	//	дд = Истина;
	//	фф = Объект.ФорматВывода;
	//ИначеЕсли ТипПараметра = Тип("Число") Тогда
	//	дд = 123456.78;
	//	фф = Объект.ФорматВывода;
	//ИначеЕсли ТипПараметра = Тип("Дата") Тогда
	//	дд = ТекущаяДата();
	//	фф = ?(ЗначениеЗаполнено(Объект.ФорматВывода), Объект.ФорматВывода, "ДФ=dd.MM.yyyy");
	//КонецЕсли; 
	//ФорматВыводаПример = Формат(дд, фф);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольИзмененияПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПриИзмененииПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеОтбораПриИзменении(Элемент)
	
	Если (Объект.ИспользованиеОтбора) Тогда
		Объект.МножественноеПрямоеРедактирование=Ложь;
		Объект.ВариантОтбора=ПредопределенноеЗначение("Перечисление.CW_ВариантыОтбораДляПараметров.СтандартныйОтбор");
		Если (Объект.ОграниченСпискомЗначений) Тогда
			Объект.ОграниченСпискомЗначений=Ложь;
		КонецЕсли; 
	КонецЕсли; 
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтбораПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры
            
&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	Объект.ФорматВывода="";
	
	// требуется проверить тип - если ссылочный - открываем закладку отбора
	_ПроверитьТипЗначения();
	
	Если не ЭтоСсылочныйТип Тогда
		Объект.ИспользоватьФормуВыбораОбъекта = Ложь;
	КонецЕсли;
	
	Объект.ИспользуютсяДополнительныеЗначения = Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ДополнительныеЗначенияПараметровГрузоперевозок");
	
	Если НЕ Объект.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
		Объект.ИспользоватьФормуВводаАдреса = Ложь;
	КонецЕсли;
	
	_УправлениеЭлементамиФормы();
	//ДиалогПодтвержденияИзмененияТипа();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогПодтвержденияИзмененияТипа()

	Если (ТипЗначенияИзменен) Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияИзмененияТипа",ЭтотОбъект, Новый Структура()); 
		ПоказатьВопрос(ПОВ,"Изменения типа может привести к потере ранее введенных значений параметра. Продолжить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодтвержденияИзмененияТипа(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			ТипЗначенияИзменен = Ложь;
			Записать();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОтбораРеквизитОтбораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// --- 
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьТипРеквизитаОтбора(ИмяРеквизита)
	// --- 
		
	Возврат(_сф.тип_ОпределитьТипРеквизита(Новый(Объект.ТипЗначения.Типы()[0]),СтрЗаменить(ИмяРеквизита,"Отбор.","")));
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ПараметрыОтбораЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТД = Элементы.ПараметрыОтбора.ТекущиеДанные;
	
	// сначала проверяем, не используется ли параметр
	Если (ТД.ВидУсловия = ПредопределенноеЗначение("Перечисление.CW_ВидыУсловийОтбораПараметров.Значение")) Тогда 
		
		// определяем тип значения текущего реквизита 
		ТипЗначения = _ПолучитьТипРеквизитаОтбора(ТД.РеквизитОтбора);
		Если ТипЗначения <> Неопределено Тогда
			
			Элемент.ОграничениеТипа = ТипЗначения;
			Элемент.ВыбиратьТип = (ТипЗначения.Типы().Количество() <> 1);
						
		КонецЕсли;
		
	ИначеЕсли (ТД.ВидУсловия = ПредопределенноеЗначение("Перечисление.CW_ВидыУсловийОтбораПараметров.Реквизит")) Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		// открываем форму выбора реквизита
		ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораРеквизитаДляОтбора",ЭтотОбъект, Новый Структура()); 
		СписокРеквизитов = _СписокРеквизитов();
		ПоказатьВыборИзСписка(ПОВ,СписокРеквизитов,Элемент);
		
	ИначеЕсли (ТД.ВидУсловия = ПредопределенноеЗначение("Перечисление.CW_ВидыУсловийОтбораПараметров.Параметр")) Тогда
		
		СтандартнаяОбработка = Ложь;
		// --- 
		// открываем форму выбора параметра грузоперевозки
		ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораПараметраДляОтбора",ЭтотОбъект); 
		ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",Новый Структура("РежимВыбора",Истина),Элемент,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _СписокРеквизитов()
	// --- 
	
	СписокРеквизитов = Новый СписокЗначений;
	// --- 
	СписокРеквизитов.Добавить("Ссылка","Текущий объект");
	СписокРеквизитов.Добавить("Клиент","Клиент");
	СписокРеквизитов.Добавить("Маршрут","Маршрут");
	СписокРеквизитов.Добавить("Груз","Груз");
	// --- 
	Возврат(СписокРеквизитов);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораРеквизитаДляОтбора(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		ТД = Элементы.ПараметрыОтбора.ТекущиеДанные;
		ТД.Значение = Ответ.Значение;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПараметраДляОтбора(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		ТД = Элементы.ПараметрыОтбора.ТекущиеДанные;
		ТД.Значение = Ответ;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ДоступенФорматВывода Тогда 
		СформироватьПримерФорматаВывода();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Объект.Наименование = СокрЛП(Объект.Наименование);
	Объект.Наименование = СтрЗаменить(Объект.Наименование,"""","");
	Объект.Наименование = СтрЗаменить(Объект.Наименование,"'","");
	Объект.Наименование = СтрЗаменить(Объект.Наименование,"«","");
	Объект.Наименование = СтрЗаменить(Объект.Наименование,"»","");
	Объект.Наименование = СтрЗаменить(Объект.Наименование,".","");
	Объект.Наименование = СтрЗаменить(Объект.Наименование,",","");
	Объект.Наименование = СтрЗаменить(Объект.Наименование,"(","");
	Объект.Наименование = СтрЗаменить(Объект.Наименование,")","");
	Объект.Наименование = СтрЗаменить(Объект.Наименование,"&","");
	Объект.Наименование = СтрЗаменить(Объект.Наименование,"^","");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМакросовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДобавитьМакрос();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМакрос()
	
	Элементы.Формула.ВыделенныйТекст = Элементы.ТаблицаМакросов.ТекущиеДанные.Макрос;
	ИзмененаФормула = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФормулВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДобавитьФормулу();
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьФормулу()
	// --- 
	
	Элементы.Формула.ВыделенныйТекст = Элементы.ТаблицаФормул.ТекущиеДанные.Макрос;
	ИзмененаФормула = Истина;
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ИспользованиеУсловногоОформленияПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УсловноеОформлениеНастройкаНажатие(Элемент)
	
	//ПФ = Новый Структура("АдресУО",АдресУО);
	//Форма = ПолучитьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактированияУсловногоОформления",ПФ);
	//Ответ = Форма.Открыть();
	//Если (Ответ <> Неопределено) Тогда
	//	АдресУО = Ответ;
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОграниченСпискомЗначенийПриИзменении(Элемент)
	
	Если (Объект.ОграниченСпискомЗначений) Тогда
		
		Если (Объект.ИспользованиеОтбора) Тогда
			Объект.ИспользованиеОтбора = Ложь;
		КонецЕсли; 
		_ПроверитьТипЗначения();
		
	КонецЕсли; 
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЗначенияДоступноеЗначениеПриИзменении(Элемент)
	
	// проверяем, что других значен
	Ответ = _ПроверитьУникальностьВведенногоЗначения(Элементы.ДоступныеЗначения.ТекущаяСтрока);
	Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ПроверитьУникальностьВведенногоЗначения(ИдентификаторСтроки)
	// --- 
	
	СтрокаПроверяемогоЗначения = Объект.ДоступныеЗначения.НайтиПоИдентификатору(ИдентификаторСтроки);
	ПроверяемоеЗначение = СтрокаПроверяемогоЗначения.ДоступноеЗначение;
	
	// --- 
	
	ДоступныеЗначения = Объект.ДоступныеЗначения.Выгрузить(,"ДоступноеЗначение");
	ДоступныеЗначения.Колонки.Добавить("Количество");
	ДоступныеЗначения.ЗаполнитьЗначения(1,"Количество");
	Если (Объект.ТипЗначения = Новый ОписаниеТипов("Строка")) Тогда
		Для каждого Стр Из ДоступныеЗначения Цикл
			
			Стр.ДоступноеЗначение = СокрЛП(ВРег(Стр.ДоступноеЗначение));
			
		КонецЦикла;
		ПроверяемоеЗначение = СокрЛП(ВРег(ПроверяемоеЗначение));
	КонецЕсли; 
	
	ДоступныеЗначения.Свернуть("ДоступноеЗначение","Количество");
	// --- 
	Для каждого Стр Из ДоступныеЗначения Цикл
		
		Если (Стр.Количество > 1) Тогда
			
			Если (Стр.ДоступноеЗначение = ПроверяемоеЗначение) Тогда
				
				Объект.ДоступныеЗначения.Удалить(Объект.ДоступныеЗначения.Индекс(СтрокаПроверяемогоЗначения));
				Возврат(_УФКС.Ответ(1,"Введено неуникальное значение"));
				
			КонецЕсли;  
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияПриИзменении(Элемент)
	
	Если (НЕ Объект.ОбработкаИзменения) Тогда
		Объект.ВнешняяОбработкаИзменения=Неопределено;
	КонецЕсли; 
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОтбораВидУсловияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПараметрыОтбора.ТекущаяСтрока;
	ПараметрыОтбораРеквизитОтбораПриИзмененииНаСервере(ТекущаяСтрока); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПараметрВТипПеревозки(Команда)
	
	ПФ = Новый Структура("РежимВыбора,МножественныйВыбор",Истина,Истина);
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораТиповГрузоперевозок",ЭтотОбъект, Новый Структура()); 
	ОткрытьФорму("Справочник.CW_ТипыПеревозок.ФормаВыбора",ПФ,ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораТиповГрузоперевозок(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Результат = _ДобавитьПараметрВТипыГрузоперевозок(Ответ);
		Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
			
			ПоказатьПредупреждение(,"Параметр успешно добавлен.");
			
		Иначе
			
			ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Результат));
			
		КонецЕсли;
		
		Элементы.СписокТиповПеревозок.Обновить();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДобавитьПараметрВТипыГрузоперевозок(ТипыГП)
	// --- 
	
	Попытка
		
		Для каждого ТипГП Из ТипыГП Цикл
			
			// проверяем, что в типе нет ещё этого параметра
			СтрокаПараметра = _сф.к_НайтиСтроку(ТипГП.ПараметрыГрузоперевозки,"Параметр",Объект.Ссылка);
			Если (СтрокаПараметра = Неопределено) Тогда
				
				ТипОбъект = ТипГП.ПолучитьОбъект();
				Нстр = ТипОбъект.ПараметрыГрузоперевозки.Добавить();
				Нстр.Параметр = Объект.Ссылка;
				ТипОбъект.Записать();
				
			КонецЕсли; 
			
		КонецЦикла;
		
	Исключение
		
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	 
	// --- 
КонецФункции

&НаКлиенте
Процедура УдалитьПараметрИзТипаПеревозки(Команда)
	
	Результат = _УдалитьПараметрИзВыбранныхТипов(Элементы.СписокТиповПеревозок.ВыделенныеСтроки);	
	Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
		
		ПоказатьПредупреждение(,"Параметр успешно удалён.");
		
	Иначе
		
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Результат));
		
	КонецЕсли;
	
	Элементы.СписокТиповПеревозок.Обновить();
	
КонецПроцедуры

&НаСервере
Функция _УдалитьПараметрИзВыбранныхТипов(Знач МассивТипов)
	// --- 
	
	Попытка
		
		Для каждого ТипГП Из МассивТипов Цикл
			
			ТипОбъект = ТипГП.ПолучитьОбъект();
			СтрокаПараметра = _сф.к_НайтиСтроку(ТипОбъект.ПараметрыГрузоперевозки,"Параметр",Объект.Ссылка);
			Если (СтрокаПараметра <> Неопределено) Тогда
				
				ТипОбъект.ПараметрыГрузоперевозки.Удалить(СтрокаПараметра);
				
			КонецЕсли; 
			ТипОбъект.Записать();
			
		КонецЦикла;
		
	Исключение
		
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ()); 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаПередНачаломВыбораПриИзменении(Элемент)
	
	Если НЕ Объект.ИспользуетсяОбработкаПередНачаломВыбора Тогда
		Объект.ВнешняяОбработкаПередНачаломВыбора = Неопределено;
	КонецЕсли; 
	_УправлениеЭлементамиФормы();
	

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьФормуВыбораОбъектаПриИзменении(Элемент)
	_УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЗначенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Если ЭтаФорма.Модифицированность или Объект.Ссылка.Пустая() Тогда
	//	
	//	Отказ 	= Истина;
	//	ПоказатьПредупреждение(,"Необходимо записать элемент справочника.");
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокДополнительныхЗначенийПараметра(Команда)
	
	Если ЭтаФорма.Модифицированность или Объект.Ссылка.Пустая() Тогда
		Отказ 	= Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияПредупрежденияОЗаписи", ЭтотОбъект);
		ПоказатьПредупреждение(ОписаниеОповещения,"Необходимо записать элемент справочника.");
	Иначе
		ОткрытьФормуСпискаДополнительныхПараметров();
	КонецЕсли;
	
КонецПроцедуры

&наКлиенте
Процедура ПослеЗакрытияПредупрежденияОЗаписи(ВходящийКонтекст) Экспорт
	
	ЭтотОбъект.Записать();
	ОткрытьФормуСпискаДополнительныхПараметров();
	
КонецПроцедуры

&наКлиенте
Процедура ОткрытьФормуСпискаДополнительныхПараметров() 
	
	ПараметрОтбора = Объект.Ссылка;
	
	СтруктураОтбора = Новый Структура("Владелец",ПараметрОтбора );
	ПараметрыФормы 	= новый Структура("УстановленОтбор,ПараметрОтбора,Отбор", Истина, ПараметрОтбора, СтруктураОтбора);
	
	ОткрытьФорму("Справочник.CW_ДополнительныеЗначенияПараметровГрузоперевозок.ФормаСписка",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрямоеРедактированиеПриИзменении(Элемент)
	
	ПриИзмененииПрямогоРедактирования();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПрямогоРедактирования()
	
	Если Не Объект.ПрямоеРедактирование Тогда
		Объект.МножественноеПрямоеРедактирование = Ложь;
	КонецЕсли;
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура НеПоказыватьВФормеГрузоперевозокПриИзмененииНаСервере()
	
	Объект.ПрямоеРедактирование 					= ложь;
	Объект.МножественноеПрямоеРедактирование 		= ложь;
	Объект.ОчищатьПриКопировании 					= ложь;
	Объект.ОграниченСпискомЗначений 				= ложь;
	Объект.ИспользованиеОтбора 						= ложь;
	
	Объект.ИспользуетсяОбработкаПередНачаломВыбора 	= ложь;
	Объект.ВнешняяОбработкаПередНачаломВыбора 		= Неопределено;
	
	Объект.ОбработкаИзменения 					= ложь;
	Объект.ВнешняяОбработкаИзменения 			= Неопределено;
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НеПоказыватьВФормеГрузоперевозокПриИзменении(Элемент)
	НеПоказыватьВФормеГрузоперевозокПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФормулаПриИзменении(Элемент)
	ИзмененаФормула = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПараметрыОтбораРеквизитОтбораПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПараметрыОтбора.ТекущаяСтрока;
	ПараметрыОтбораРеквизитОтбораПриИзмененииНаСервере(ТекущаяСтрока); 
	
КонецПроцедуры 

&НаСервере
Процедура ПараметрыОтбораРеквизитОтбораПриИзмененииНаСервере(ТекущаяСтрока)
	
	СтрокаТекущая = Объект.ПараметрыОтбора.НайтиПоИдентификатору(ТекущаяСтрока);
	
	ОписаниеТипа = ОписаниеТиповОтбора.Получить(СтрокаТекущая.РеквизитОтбора);
	СтрокаТекущая.Значение = ОписаниеТипа.ПривестиЗначение(Неопределено); 
	
КонецПроцедуры

&НаКлиенте
Процедура СохранятьПолноеЗначениеПараметраПриИзменении(Элемент)

	Если Объект.СохранятьПолноеЗначениеПараметра Тогда
		Объект.ИспользоватьФормуВводаАдреса = Ложь;
	КонецЕсли;
	
	ТипЗначенияИзменен = ЗначениеРеквизитаИзменилосьНаСервере("СохранятьПолноеЗначениеПараметра");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьФормуВводаАдресаПриИзменении(Элемент)
	
	Если Объект.ИспользоватьФормуВводаАдреса Тогда
		Объект.СохранятьПолноеЗначениеПараметра = Ложь;
		ТипЗначенияИзменен = ЗначениеРеквизитаИзменилосьНаСервере("СохранятьПолноеЗначениеПараметра");
	КонецЕсли;
	
КонецПроцедуры
